mental_health_survey_be/app/models/survey_response.rb

SELECT "survey_responses".* FROM "survey_responses"
SELECT 1 AS one FROM "survey_responses" LIMIT 1
SELECT COUNT(*) FROM "survey_responses"
---
  def self.average_stress_level
    responses = self.all
    return 0 if responses.empty?
    average = responses.sum(&:stress_level).to_f / responses.count