mental_health_survey_be/app/controllers/api/v1/survey_responses_controller.rb

      def index
        # Only return aggregated data, not individual responses for privacy
        render json: {
          data: {
            total_responses: SurveyResponse.count,
            average_stress_level: SurveyResponse.average_stress_level
---
SELECT "survey_responses".* FROM "survey_responses"
SELECT COUNT(*) FROM "survey_responses"

      def create
        @survey_response = SurveyResponse.new(survey_response_params)

        if @survey_response.save
---
INSERT INTO "survey_responses" ("today_feeling", "stress_level", "comments", "today_feeling_bidx", "stress_level_bidx", "comments_bidx", "created_at", "updated_at", "respondent_id", "respondent_id_bidx") VALUES ('{"p":"FM8=","h":{"iv":"BxcP2an1KzMgskNw","at":"UOTv2zS6KiZM9/NOtmtmxg=="}}', '{"p":"DA==","h":{"iv":"dFeDawrUkF8Bf0J4","at":"ZOypYSPLhxRVQ7u7npE0cA==","e":"VVMtQVNDSUk="}}', '{"p":"","h":{"iv":"imHaJtmQFjdgVRrz","at":"s/AsblQ0PVVjNVDD+k6rig=="}}', 'wdztuZ93MGESQik6F03hCBczKWnK5RgQC0M7jxBqQwk=', 'Z7L40M+Q2ftRp4AZB4uNQceSBjYlD2YTii2PpvwfCFM=', 'jOZ54IQF6aexFXcfgRz+WilV3Us+OJOdlO+6wWGvRXM=', '2025-05-15 22:54:31.770615', '2025-05-15 22:54:31.770615', NULL, NULL) RETURNING "id"